app/Controllers/Libros.php

    public function index(){

        $libro = new Libro();
        $datos['libros'] = $libro->orderBy('id_libro','ASC')->findAll();
---
SELECT *
FROM `libros`
ORDER BY `id_libro` ASC

    public function guardar(){

        $libro = new Libro();

        $nombrelibro=$this->request->getVar('nombrelibro');

        if($imagenlibro=$this->request->getFile('imagenlibro')){

            $nuevoImagenlibro=$imagenlibro->getRandomName();
            $imagenlibro->move('../public/imagenes/',$nuevoImagenlibro);

            $datos=[
                'nombre_libro'=>$nombrelibro,
                'imagen_libro'=>$nuevoImagenlibro
            ];

            $libro->insert($datos);
---
INSERT INTO `libros` (`nombre_libro`, `imagen_libro`) VALUES ('Libro 2', '1650292378_00620e05f12b6cbf5510.jpg')

    public function editar($id_libro=null){

        $libro = new Libro();

        $datos['libro']=$libro->where('id_libro',$id_libro)->first();
---
SELECT *
FROM `libros`
WHERE `id_libro` = '1'
 LIMIT 1